package tamil.words.game.unscramble.ui.game
const val MAX_NO_OF_WORDS = 10
const val SCORE_INCREASE = 20
var levelsinfo: String? =null
// List with all the words for the Game
val allWordsListLevel1 : List<String> =
    listOf(
        "பச்சை",
        "மஞ்சள்",
        "வெள்ளை",
        "நீலம்",
        "கருப்பு",
        "சிகப்பு",
        "இளஞ்சிகப்பு",
        "ஆரஞ்சு",
        "சாம்பல்",
        "பழுப்பு"
    )
val allWordsListLevel2 : List<String> =
    listOf(
        "ஊறுகாய்",
        "சப்பாத்தி",
        "பொரியல்",
        "சாதம்",
        "அப்பளம்",
        "ஆப்பம்",
        "குழம்பு",
        "பாயசம்",
        "சட்னி",
        "சாம்பார்",
        "ரசம்",
        "இட்லி",
        "உப்புமா",
        "இடியாப்பம்",
        "அவியல்",
        "பிரியாணி",
        "வறுவல்"
    )
val allWordsListLevel3 : List<String> =
    listOf(
        "தோள்பட்டை",
        "இதயம்",
        "நுரையீரல்",
        "மூக்கு",
        "முழங்கால்",
        "வயிறு",
        "குடல்",
        "நெற்றி",
        "எலும்புகள்",
        "கழுத்து"
    )
val allWordsListLevel5: List<String> =
    listOf(
        "தர்பூசணி",
        "முட்டைக்கோஸ்",
        "பட்டாணி",
        "பேரிக்காய்",
        "பப்பாளி",
        "குடைமிளகாய்",
        "முலாம்பழம்",
        "திராட்சை",
        "வெண்ணெய்பழம்",
        "காளான்",
        "அவரைக்காய்",
        "பாகற்காய்"
    )
val allWordsListLevel6 : List<String> =
    listOf(
        "மேசை",
        "அடுப்பு",
        "குளிர்சாதன பெட்டி",
        "கணினி",
        "தொலைக்காட்சி",
        "கடிகாரம்",
        "கிண்ணம்",
        "கரண்டி",
        "அலமாரி",
        "கண்ணாடி",
        "போர்வை",
        "படுக்கை",
        "நாற்காலி",
        "விசிறி"
    )
val allWordsListLevel7 : List<String> =
    listOf(
        "மகாபாரதம்",
        "சிலப்பதிகாரம்",
        "மணிமேகலை",
        "திருக்குறள்",
        "புறநானூறு",
        "தொல்காப்பியம்",
        "குறுஞ்சிப்பாட்டு",
        "குண்டலகேசி",
        "பத்துப்பாட்டு",
        "எட்டுத்தொகை",
        "பரிபாடல்",
        "பாஞ்சாலிசபதம்"
    )
val allWordsListLevel4 : List<String> =
    listOf(
        "மாடு",
        "கழுதை",
        "சிங்கம்",
        "சிறுத்தை",
        "திமிங்கிலம்",
        "மரங்கொத்தி",
        "கடற்குதிரை",
        "காட்டுபன்றி",
        "கலைமான்",
        "குரங்கு",
        "நீர்யானை",
        "காண்டா மிருகம்"
    )
val allWordsListLevel8 : List<String> =
    listOf(
        "பாராளுமன்றம்",
        "வாக்கு",
        "தேர்தல்",
        "மாநகராட்சி",
        "மத்திய அரசு",
        "அமைச்சர்",
        "தேசியவாதம்",
        "எதிர்க்கட்சிகள்",
        "ஜனநாயகம்",
        "திட்டம்",
        "கடமைகள்",
        "சட்டமன்றம்",
        "வலதுசாரி",
        "அறிக்கை",
        "சபாநாயகர்"
    )
val allWordsListLevel9 : List<String> =
    listOf(
        "அண்ட்ராய்டு",
        "மடிக்கணினி",
        "விக்கிபீடியா",
        "எழுத்துப்பலகை",
        "கணிப்பான்",
        "சமூக ஊடகம்",
        "பயன்பாட்டுச்செயலி",
        "மின்னஞ்சல்",
        "நிலைவட்டு",
        "மின் வணிகம்"
    )